_posts/2021-07-25-writing-live-documents-in-newspeak-ampleforth-in-org-mode.html
---
date: 2021-07-25 01:45
author: mzimmerm
layout: post
title: Writing live documents in Newspeak Ampleforth in Org Mode
excerpt: Writing live documents in Newspeak Ampleforth in Org Mode
tags: 
- newspeak
- org
- emacs
- ampleforth
categories: 
- newspeak
- org
- emacs
- ampleforth
---
<p>
Space for Newspeak here!
</p>

<div class="evaluator" expression = "11+22
"> </div>

<p>
This is all.
</p>

<div id="outline-container-org28dfb82" class="outline-2">
<h2 id="org28dfb82">Changes I did to make it work</h2>
<div class="outline-text-2" id="text-org28dfb82">
<ol class="org-ol">
<li><p>
In init.el, overrode (using ":before-until" advice) handling of function <code>org-html-src-block</code> from ox-html.el. The change, upon encountering a src_block with language newspeak, exports a div with a class <code>evaluator</code> used by Ampleforth.js. Place the following advice to the init.el
</p>
<div class="org-src-container">
<pre class="src src-elisp">(advice-remove 'org-html-src-block #'org-html-src-block-newspeak)

<span style="color: #73d216;">;; </span><span style="color: #73d216;">Advice to handle newspeak begin_src end_src.</span>
(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">org-html-src-block-newspeak</span>  (src-block _contents info)
  (<span style="color: #b4fa70;">let*</span> ((code (org-html-format-code src-block info))
         (lang (org-element-property <span style="color: #e090d7;">:language</span> src-block))
         )
    (<span style="color: #b4fa70;">if</span> (string-equal <span style="color: #e9b96e;">"newspeak"</span> lang)
        (format <span style="color: #e9b96e;">"&lt;div class=\"evaluator\" expression = \"%s\"&gt; &lt;/div&gt;"</span> code))))

(advice-add 'org-html-src-block <span style="color: #e090d7;">:before-until</span> #'org-html-src-block-newspeak)

</pre>
</div></li>
<li><p>
In the blog org file: Added BEGIN_EXPORT html with 2 sections. First section adds styling on elements with class="evaluator", the second section adds the script with Ampleforth.js. NOTE: This must be at the end, for the script to be at the end of body or after the body.
</p>
<pre class="example" id="orgc70709e">
#+begin_export html
   &lt;style&gt; img {width: 25px; height: 25px;} &lt;/style&gt; &lt;style&gt; .evaluator + pre {display: none;} .preview .evaluator + pre {display: block;} &lt;/style&gt;
   &lt;script type="text/javascript" class="preview" src="/js/Ampleforth.sources.js"&gt;&lt;/script&gt;
   &lt;script type="text/javascript" class="preview" src="/js/Ampleforth.js"&gt;&lt;/script&gt;
#+end_export
</pre></li>
<li>Added the following files in the blog directory <code>$BLOG</code> (there is where Jekyll serves from):
<ul class="org-ul">
<li>Added <code>$BLOG/js/Ampleforth.js</code> and <code>$BLOG/js/Ampleforth.sources.js</code></li>
<li><p>
In <code>$BLOG/img</code>, added images:
</p>
<pre class="example" id="orge89938d">
"/accept16px.png"
"/cancel16px.png"
"/disclosureClosedImage.png"
"/disclosureTransitionImage.png"
"/disclosureOpenImage.png"
"/hsDropdownImage.png"
"/hsDropdownOutImage.png"
"/hsDropdownOverImage.png"
"/publicImage.png"
"/protectedImage.png"
"/privateImage.png"
"/hsAddImage.png"
"/hsAddOutImage.png"
"/hsAddOverImage.png"
"/hsDropdownImage.png"
"/hsDropdownOutImage.png"
"/hsDropdownOverImage.png"
"/hsExpandImage.png"
"/hsExpandOverImage.png"
"/hsExpandDownImage.png"
"/hsCollapseImage.png"
"/hsCollapseOverImage.png"
"/hsCollapseDownImage.png"
"/hsHomeImage.png"
"/hsHomeOverImage.png"
"/hsHomeOutImage.png"
"/hsHomeDownImage.png"
"/classPresenterImage.png"
"/classUnknownImage.png"
"/languageNewspeak3.png"
</pre></li>
</ul></li>
<li>In Ampleforth.js: replaced <code>i.src = "</code> with <code>i.src = "/img/</code></li>
</ol>
</div>
</div>

<div id="outline-container-org2d71a07" class="outline-2">
<h2 id="org2d71a07">This must be at the end</h2>
<div class="outline-text-2" id="text-org2d71a07">
 <style> img {width: 25px; height: 25px;} </style> <style> .evaluator + pre {display: none;} .preview .evaluator + pre {display: block;} </style>
<script type="text/javascript" class="preview" src="/js/Ampleforth.sources.js"></script>
<script type="text/javascript" class="preview" src="/js/Ampleforth.js"></script>
</div>
</div>
